from subprocess import Popen, PIPE

inputs = [
    "PostMalone",
    "KanyeWest",
    "Rihanna",
    "f",
    "5252525252525252525252525252525252525252525252525252525252525252525252522525525252525"
    "252255252525252525252525252525252525252525225252525252525255252525252525252525252525252525252525252525252"
    "525252525252525252525525252525255252525252552525252525252525252525252525252525252525"
    "25252525252525252525252525252525252525252522525525252525252255252525252525252525252525"
    "25252525252522525252525252525525252525252525252525252525252525252525252525252525252525252"
    "52525255252525252552525252525525252525252525252525252525252525252525252525252525252525252525"
    "25252525252525252525225255252525252522552525252525252525252525252525252525252252525252525252552"
    "52525252525252525252525252525252525252525252525252525252525252525525252525255252525252552525252",
    "",
    "@#$%^&*()!",
    "a" * 10000
]

outputs = [
    "28",
    "46",
    "35",
    "",
    "",
    "",
    "",
    "",
    ""
]

errors = [
    "",
    "",
    "",
    "no entry found error",
    "line reading error",
    "max input size exceeded error",
    "empty input error",
    "invalid characters error",
    "max input size exceeded error"
]


for i in range(len(inputs)):
  p = Popen(["./main"],
        stdin=PIPE,
        stdout=PIPE,
        stderr=PIPE)
  inp = inputs[i]
  out = outputs[i]
  err = errors[i]
  data = p.communicate(inp.encode())
  if data[0].decode().strip() == out and data[1].decode().strip() == err:
    print("Тесты прошли с входными данными: \"" + inp + "\"")
  else:
    print("Тесты не пройдены: \"" + data[0].decode().strip() + "\", stderr: \"" + data[1].decode().strip() + "\". Ожидаемый ответ: \"" + out + "\", stderr: \"" + err + "\"")
